package com.lanou3g.xiaoxiongyouhao.bean;

import java.util.List;

/**
 * Created by dllo on 17/4/24.
 */

public class CarBrandBean {


    /**
     * total : 216
     * idxes : [134,117,276,272,253,251,33,221,34,35,180,40,38,27,154,143,203,208,173,95,36,231,15,120,39,140,37,14,13,75,271,196,79,77,76,163,264,169,217,81,32,142,259,187,113,165,1,92,158,280,41,211,132,3,176,42,197,8,96,282,141,11,112,115,116,82,108,278,152,245,237,85,87,260,220,184,181,24,164,43,267,150,86,91,240,97,46,151,209,25,44,84,119,270,210,175,83,145,109,9,139,214,47,224,199,156,219,191,101,100,241,279,285,48,80,118,54,244,183,51,78,124,89,121,50,49,53,204,88,215,52,10,261,20,56,250,268,168,57,129,55,58,136,213,130,59,146,242,60,186,61,222,235,122,26,62,193,174,63,103,19,127,138,269,137,45,68,155,66,90,69,162,65,67,238,64,205,149,135,200,202,133,161,223,233,283,167,114,99,102,159,70,192,284,185,12,98,71,72,110,286,144,232,93,243,73,111,263,74,22,182,94,206,500,600,900]
     * names : ["A　ABT","A　AC Schnitzer","A　ALPINA","A　ARCFOX","A　Apollo","A　Arash","A　奥迪","A　安凯客车","A　阿尔法罗密欧","A　阿斯顿·马丁","B　BAC","B　保时捷","B　别克","B　北京","B　北汽制造","B　北汽威旺","B　北汽幻速","B　北汽新能源","B　北汽绅宝","B　奔腾","B　奔驰","B　宝沃","B　宝马","B　宝骏","B　宾利","B　巴博斯","B　布加迪","B　本田","B　标致","B　比亚迪","B　比速汽车","C　成功汽车","C　昌河","C　长城","C　长安","C　长安商用","C　长江EV","D　DS","D　Datsun","D　东南","D　东风","D　东风小康","D　东风风光","D　东风风度","D　东风风神","D　东风风行","D　大众","D　大发","D　大迪","D　电咖","D　道奇","E　Elemental","F　Fisker","F　丰田","F　弗那萨利","F　法拉利","F　福汽启腾","F　福特","F　福田","F　福田乘用车","F　福迪","F　菲亚特","G　GMC","G　Gumpert","G　光冈","G　广汽传祺","G　广汽吉奥","G　广通客车","G　观致","H　华凯","H　华利","H　华普","H　华泰","H　华泰新能源","H　华颂","H　华骐","H　哈弗","H　哈飞","H　恒天","H　悍马","H　汉腾汽车","H　海格","H　海马","H　红旗","H　霍顿","H　黄海","J　Jeep","J　九龙","J　佳跃","J　吉利汽车","J　捷豹","J　江淮","J　江铃","J　江铃集团新能源","J　江铃集团轻汽","J　金旅","J　金杯","J　金龙","K　KTM","K　克莱斯勒","K　凯佰赫","K　凯翼","K　凯迪拉克","K　卡升","K　卡威","K　卡尔森","K　康迪全球鹰","K　开利","K　开瑞","K　科尼赛克","L　LOCAL MOTORS","L　LYNK&CO","L　Lucid","L　兰博基尼","L　力帆汽车","L　劳伦士","L　劳斯莱斯","L　拉达","L　朗世","L　林肯","L　猎豹汽车","L　理念","L　莲花汽车","L　蓝旗亚","L　路特斯","L　路虎","L　铃木","L　陆地方舟","L　陆风","L　雷丁","L　雷克萨斯","L　雷诺","L　雷诺三星","M　MG","M　MINI","M　Mahindra","M　Mazzanti","M　摩根","M　玛莎拉蒂","M　迈凯伦","M　迈巴赫","M　马自达","N　Noble","N　南京金龙","N　纳智捷","O　欧宝","O　欧朗","O　欧联","O　讴歌","P　佩奇奥","P　帕加尼","Q　乔治·巴顿","Q　前途","Q　启辰","Q　奇瑞","Q　起亚","R　Rinspeed","R　如虎","R　日产","R　瑞麒","R　荣威","S　SPIRRA","S　SSC","S　SWM斯威汽车","S　Scion","S　smart","S　三菱","S　上汽大通","S　世爵","S　双环","S　双龙","S　思铭","S　斯巴鲁","S　斯柯达","S　斯达泰克","S　萨博","S　赛麟","S　陕汽通家","T　TVR","T　塔塔","T　泰卡特","T　特斯拉","T　腾势","V　Venturi","W　W Motors","W　WEY","W　五十铃","W　五菱汽车","W　威兹曼","W　威麟","W　沃克斯豪尔","W　沃尔沃","W　潍柴英致","W　蔚来","X　新凯","X　现代","X　西雅特","X　雪佛兰","X　雪铁龙","Y　一汽","Y　云度","Y　依维柯","Y　御捷","Y　永源","Y　游侠","Y　英菲尼迪","Y　野马汽车","Y　驭胜","Z　中兴","Z　中华","Z　之诺","Z　众泰","Z　知豆","台湾","货车","摩托车和其他"]
     */

    private int total;
    private List<Integer> idxes;
    private List<String> names;

    @Override
    public String toString () {
        return "CarBrandBean{" +
                "idxes=" + idxes +
                ", total=" + total +
                ", names=" + names +
                '}';
    }

    public int getTotal () {
        return total;
    }

    public void setTotal (int total) {
        this.total = total;
    }

    public List<Integer> getIdxes () {
        return idxes;
    }

    public void setIdxes (List<Integer> idxes) {
        this.idxes = idxes;
    }

    public List<String> getNames () {
        return names;
    }

    public void setNames (List<String> names) {
        this.names = names;
    }
}
